#ifndef ui_definition
#define ui_definition

// ___________________________________ ui.h ___________________________________

// alphabetical order is not possible because of headers interdependencies
#include "sfh_posix.h"
// ________________________________ ui_win32.h ________________________________

// ui is Windows-only. This header pulls in the Win32 SDK subset the ui.*
// implementation and ui consumers need. The runtime (posix.*) stays free of
// <Windows.h>; posix_b2e()/posix_win32_close_handle()/posix_wait_ix2e() are
// declared in posix.h (gated on _WIN32) and only reference Win32 APIs at the
// expansion site, so this header must be included before they are used.

#if defined(_WIN32)

#pragma warning(push)
#pragma warning(disable: 4255) // no function prototype: '()' to '(void)'
#pragma warning(disable: 4459) // declaration of '...' hides global declaration
#pragma warning(disable: 4668) // SDK headers (e.g. shellapi.h) test version
                               // macros like NTDDI_WIN10_GE that older SDKs
                               // do not define; harmless under /Wall

#pragma push_macro("UNICODE")
#define UNICODE // always because otherwise IME does not work

#include <Windows.h>
#include <Psapi.h>
#include <shellapi.h>
#include <winternl.h>
#include <initguid.h>
#include <KnownFolders.h>
#include <AclAPI.h>
#include <ShlObj_core.h>
#include <Shlwapi.h>
#include <commdlg.h>
#include <dbghelp.h>
#include <dwmapi.h>

#define ui_glyph_squared_new "\xF0\x9F\x86\x95"

// Lady Beetle
// https://compart.com/en/unicode/U+1F41E
#define ui_glyph_lady_beetle "\xF0\x9F\x90\x9E"

// Brain
// https://compart.com/en/unicode/U+1F9E0
#define ui_glyph_brain "\xF0\x9F\xA7\xA0"

// South West Arrow with Hook
// https://www.compart.com/en/unicode/U+2926
#define ui_glyph_south_west_arrow_with_hook "\xE2\xA4\xA6"

// North West Arrow with Hook
// https://www.compart.com/en/unicode/U+2923
#define ui_glyph_north_west_arrow_with_hook "\xE2\xA4\xA3"

// White Sun with Rays
// https://www.compart.com/en/unicode/U+263C
#define ui_glyph_white_sun_with_rays "\xE2\x98\xBC"

// Black Sun with Rays
// https://www.compart.com/en/unicode/U+2600
#define ui_glyph_black_sun_with_rays "\xE2\x98\x80"

// Sun Behind Cloud
// https://www.compart.com/en/unicode/U+26C5
#define ui_glyph_sun_behind_cloud "\xE2\x9B\x85"

// White Sun
// https://www.compart.com/en/unicode/U+1F323
#define ui_glyph_white_sun "\xF0\x9F\x8C\xA3"

// Crescent Moon
// https://www.compart.com/en/unicode/U+1F319
#define ui_glyph_crescent_moon "\xF0\x9F\x8C\x99"

// Latin Capital Letter E with Cedilla and Breve
// https://compart.com/en/unicode/U+1E1C
#define ui_glyph_E_with_cedilla_and_breve "\xE1\xB8\x9C"

// Box Drawings Heavy Vertical and Horizontal
// https://compart.com/en/unicode/U+254B
#define ui_glyph_box_drawings_heavy_vertical_and_horizontal "\xE2\x95\x8B"

// Box Drawings Light Diagonal Cross
// https://compart.com/en/unicode/U+2573
#define ui_glyph_box_drawings_light_diagonal_cross "\xE2\x95\xB3"

// Combining Enclosing Square
// https://compart.com/en/unicode/U+20DE
#define ui_glyph_combining_enclosing_square "\xE2\x83\x9E"

// Combining Enclosing Screen
// https://compart.com/en/unicode/U+20E2
#define ui_glyph_combining_enclosing_screen "\xE2\x83\xA2"

// Combining Enclosing Keycap
// https://compart.com/en/unicode/U+20E3
#define ui_glyph_combining_enclosing_keycap "\xE2\x83\xA3"

// Combining Enclosing Circle
// https://compart.com/en/unicode/U+20DD
#define ui_glyph_combining_enclosing_circle "\xE2\x83\x9D"

// Frame with Picture
// https://compart.com/en/unicode/U+1F5BC
#define ui_glyph_frame_with_picture "\xF0\x9F\x96\xBC"
// with emoji variation selector: "\xF0\x9F\x96\xBC\xEF\xB8\x8F"

// Document with Picture
// https://compart.com/en/unicode/U+1F5BB
#define ui_glyph_document_with_picture "\xF0\x9F\x96\xBB"

// Frame with Tiles
// https://compart.com/en/unicode/U+1F5BD
#define ui_glyph_frame_with_tiles "\xF0\x9F\x96\xBD"

// Frame with an X
// https://compart.com/en/unicode/U+1F5BE
#define ui_glyph_frame_with_an_x "\xF0\x9F\x96\xBE"

// Left Right Arrow
// https://compart.com/en/unicode/U+2194
#define ui_glyph_left_right_arrow "\xE2\x86\x94"

// Up Down Arrow
// https://compart.com/en/unicode/U+2195
#define ui_glyph_up_down_arrow "\xE2\x86\x95"

// ________________________________ ui_core.h _________________________________

posix_begin_c

struct ui_point { int32_t x, y; };
struct ui_rect { int32_t x, y, w, h; };
struct ui_ltrb { int32_t left, top, right, bottom; };
struct ui_wh { int32_t w, h; };

typedef struct ui_window*  ui_window_t;
typedef struct ui_icon*    ui_icon_t;
typedef struct ui_canvas*  ui_canvas_t;
typedef struct ui_texture* ui_texture_t;
typedef struct ui_font*    ui_font_t;
typedef struct ui_brush*   ui_brush_t;
typedef struct ui_pen*     ui_pen_t;
typedef struct ui_cursor*  ui_cursor_t;
typedef struct ui_region*  ui_region_t;

typedef uintptr_t ui_timer_t; // timer not the same as "id" in set_timer()!

struct ui_bitmap { // TODO: ui_ namespace
    void* pixels;
    int32_t w; // width
    int32_t h; // height
    int32_t bpp;    // "components" bytes per pixel
    int32_t stride; // bytes per scanline rounded up to: (w * bpp + 3) & ~3
    ui_texture_t texture; // device allocated texture handle
    void* dxd; // cached Direct2D device bitmap, owned by dxd_* (do not touch)
};

// struct ui_margins are used for padding and insets and expressed
// in partial "em"s not in pixels, inches or points.
// Pay attention that "em" is not square. "M" measurement
// for most fonts are em.w = 0.5 * em.h
// .em square pixel size of glyph "m"
// https://en.wikipedia.org/wiki/Em_(typography)

struct ui_margins { // in partial "em"s
    fp32_t left;
    fp32_t top;
    fp32_t right;
    fp32_t bottom;
};

struct ui_if {
    bool (*point_in_rect)(const struct ui_point* p, const struct ui_rect* r);
    // intersect_rect(null, r0, r1) and intersect_rect(r0, r0, r1) supported.
    bool (*intersect_rect)(struct ui_rect* destination, const struct ui_rect* r0,
                                                   const struct ui_rect* r1);
    struct ui_rect (*combine_rect)(const struct ui_rect* r0, const struct ui_rect* r1);
    const int32_t infinity; // = INT32_MAX, look better
    struct { // align bitset
        int32_t const center; // = 0, default
        int32_t const left;   // left|top, left|bottom, right|bottom
        int32_t const top;
        int32_t const right;  // right|top, right|bottom
        int32_t const bottom;
    } const align;
    struct { // window visibility
        int32_t const hide;
        int32_t const normal;   // should be use for first .show()
        int32_t const minimize; // activate and minimize
        int32_t const maximize; // activate and maximize
        int32_t const normal_na;// same as .normal but no activate
        int32_t const show;     // shows and activates in current size and position
        int32_t const min_next; // minimize and activate next window in Z order
        int32_t const min_na;   // minimize but do not activate
        int32_t const show_na;  // same as .show but no activate
        int32_t const restore;  // from min/max to normal window size/pos
        int32_t const defau1t;  // use Windows STARTUPINFO value
        int32_t const force_min;// minimize even if dispatch thread not responding
    } const visibility;
    // TODO: remove or move inside app
    struct { // message:
        int32_t const animate;
        int32_t const opening;
        int32_t const closing;
   } const message;
   // TODO: remove or move inside app
   struct { // mouse buttons bitset mask
        struct {
            int32_t const left;
            int32_t const right;
        } button;
    } const mouse;
    struct { // window decorations hit test results
        int32_t const error;            // -2
        int32_t const transparent;      // -1
        int32_t const nowhere;          // 0
        int32_t const client;           // 1
        int32_t const caption;          // 2
        int32_t const system_menu;      // 3
        int32_t const grow_box;         // 4
        int32_t const menu;             // 5
        int32_t const horizontal_scroll;// 6
        int32_t const vertical_scroll;  // 7
        int32_t const min_button;       // 8
        int32_t const max_button;       // 9
        int32_t const left;             // 10
        int32_t const right;            // 11
        int32_t const top;              // 12
        int32_t const top_left;         // 13
        int32_t const top_right;        // 14
        int32_t const bottom;           // 15
        int32_t const bottom_left;      // 16
        int32_t const bottom_right;     // 17
        int32_t const border;           // 18
        int32_t const object;           // 19
        int32_t const close;            // 20
        int32_t const help;             // 21
    } const hit_test;
    struct { // virtual keyboard keys
        int32_t const up;
        int32_t const down;
        int32_t const left;
        int32_t const right;
        int32_t const home;
        int32_t const end;
        int32_t const page_up;
        int32_t const page_down;
        int32_t const insert;
        int32_t const del;
        int32_t const back;
        int32_t const escape;
        int32_t const enter;
        int32_t const plus;
        int32_t const minus;
        int32_t const f1;
        int32_t const f2;
        int32_t const f3;
        int32_t const f4;
        int32_t const f5;
        int32_t const f6;
        int32_t const f7;
        int32_t const f8;
        int32_t const f9;
        int32_t const f10;
        int32_t const f11;
        int32_t const f12;
        int32_t const f13;
        int32_t const f14;
        int32_t const f15;
        int32_t const f16;
